** Global
#+BEGIN_SRC emacs-lisp
  (global-set-key (kbd "C-c s") 'eshell)
  (global-set-key (kbd "C-x p f") 'project-find-file)
  (global-set-key (kbd "C-c r") 'project-find-regexp)
  (keyboard-translate ?\C-h ?\C-x)
  (keyboard-translate ?\C-x ?\C-h)
#+END_SRC

#+RESULTS:
: 8

** Rust
:LOGBOOK:
CLOCK: [2024-04-26 Fri 10:53]--[2024-04-26 Fri 10:53] =>  0:00
:END:
#+begin_src emacs-lisp
  (use-package rustic
    :ensure t)
#+end_src

#+RESULTS:

*** Eshell 
#+begin_src emacs-lisp
  (add-to-list 'display-buffer-alist
               '("\\*e?shell\\*"
                 (display-buffer-reuse-window)
                 (display-buffer-below-selected)
                 (window-height . 12)
                 ))

  (add-to-list 'display-buffer-alist
               '("\\*vterm\\*"
                 (display-buffer-reuse-window)
                 (display-buffer-below-selected)
                 ))
  (add-to-list 'display-buffer-alist
               '("\\*Org Src settings.org\\[ emacs-lisp \\]\\*"
                 (display-buffer-reuse-window)
                 (display-buffer-below-selected)
                 ))

#+end_src

#+RESULTS:
| \*Org Src settings.org\[ emacs-lisp \]\* | (display-buffer-reuse-window) | (display-buffer-below-selected) |                      |
| \*Org Src settings.org[ emacs-lisp ]\*   | (display-buffer-reuse-window) | (display-buffer-below-selected) |                      |
| \*Org                                    | (display-buffer-reuse-window) | (display-buffer-below-selected) |                      |
| \*Org Src\.\+                            | (display-buffer-reuse-window) | (display-buffer-below-selected) |                      |
| \*Org Src.+                              | (display-buffer-reuse-window) | (display-buffer-below-selected) |                      |
| \*vterm\*                                | (display-buffer-reuse-window) | (display-buffer-below-selected) | (window-height . 12) |
| \*e?shell\*                              | (display-buffer-reuse-window) | (display-buffer-below-selected) | (window-height . 12) |
| \*v?e?shell\*                            | (display-buffer-reuse-window) | (display-buffer-below-selected) | (window-height . 12) |
| \*Org Src                                | (display-buffer-reuse-window) | (display-buffer-below-selected) |                      |
| *Org Src*                                  | (display-buffer-reuse-window) | (display-buffer-below-selected) |                      |
| \*Org Src\*                              | (display-buffer-reuse-window) | (display-buffer-below-selected) |                      |
| \*eshell\*                               | (display-buffer-reuse-window) | (display-buffer-below-selected) | (window-height . 12) |
